analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/usbhs_regs.h
/**
 * @file    usbhs_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the USBHS Peripheral Module.
 * @note    This file is @generated.
 * @ingroup usbhs_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. All Rights Reserved.
 * (now owned by Analog Devices, Inc.),
 * Copyright (C) 2023 Analog Devices, Inc. All Rights Reserved. This software
 * is proprietary to Analog Devices, Inc. and its licensors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_USBHS_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_USBHS_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     usbhs
 * @defgroup    usbhs_registers USBHS_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the USBHS Peripheral Module.
 * @details     USB 2.0 High-speed Controller.
 */

/**
 * @ingroup usbhs_registers
 * Structure type to access the USBHS Registers.
 */
typedef struct {
    __IO uint8_t  faddr;                /**< <tt>\b 0x00:</tt> USBHS FADDR Register */
    __IO uint8_t  power;                /**< <tt>\b 0x01:</tt> USBHS POWER Register */
    __IO uint16_t intrin;               /**< <tt>\b 0x02:</tt> USBHS INTRIN Register */
    __IO uint16_t introut;              /**< <tt>\b 0x04:</tt> USBHS INTROUT Register */
    __IO uint16_t intrinen;             /**< <tt>\b 0x06:</tt> USBHS INTRINEN Register */
    __IO uint16_t introuten;            /**< <tt>\b 0x08:</tt> USBHS INTROUTEN Register */
    __IO uint8_t  intrusb;              /**< <tt>\b 0x0A:</tt> USBHS INTRUSB Register */
    __IO uint8_t  intrusben;            /**< <tt>\b 0x0B:</tt> USBHS INTRUSBEN Register */
    __IO uint16_t frame;                /**< <tt>\b 0x0C:</tt> USBHS FRAME Register */
    __IO uint8_t  index;                /**< <tt>\b 0x0E:</tt> USBHS INDEX Register */
    __IO uint8_t  testmode;             /**< <tt>\b 0x0F:</tt> USBHS TESTMODE Register */
    __IO uint16_t inmaxp;               /**< <tt>\b 0x10:</tt> USBHS INMAXP Register */
    union {
        __IO uint8_t  csr0;             /**< <tt>\b 0x12:</tt> USBHS CSR0 Register */
        __IO uint8_t  incsrl;           /**< <tt>\b 0x12:</tt> USBHS INCSRL Register */
    };
    __IO uint8_t  incsru;               /**< <tt>\b 0x13:</tt> USBHS INCSRU Register */
    __IO uint16_t outmaxp;              /**< <tt>\b 0x14:</tt> USBHS OUTMAXP Register */
    __IO uint8_t  outcsrl;              /**< <tt>\b 0x16:</tt> USBHS OUTCSRL Register */
    __IO uint8_t  outcsru;              /**< <tt>\b 0x17:</tt> USBHS OUTCSRU Register */
    union {
        __IO uint16_t count0;           /**< <tt>\b 0x18:</tt> USBHS COUNT0 Register */
        __IO uint16_t outcount;         /**< <tt>\b 0x18:</tt> USBHS OUTCOUNT Register */
    };
    __R  uint16_t rsv_0x1a_0x1f[3];
    __IO uint32_t fifo0;                /**< <tt>\b 0x20:</tt> USBHS FIFO0 Register */
    __IO uint32_t fifo1;                /**< <tt>\b 0x24:</tt> USBHS FIFO1 Register */
    __IO uint32_t fifo2;                /**< <tt>\b 0x28:</tt> USBHS FIFO2 Register */
    __IO uint32_t fifo3;                /**< <tt>\b 0x2c:</tt> USBHS FIFO3 Register */
    __IO uint32_t fifo4;                /**< <tt>\b 0x30:</tt> USBHS FIFO4 Register */
    __IO uint32_t fifo5;                /**< <tt>\b 0x34:</tt> USBHS FIFO5 Register */
    __IO uint32_t fifo6;                /**< <tt>\b 0x38:</tt> USBHS FIFO6 Register */
    __IO uint32_t fifo7;                /**< <tt>\b 0x3c:</tt> USBHS FIFO7 Register */
    __IO uint32_t fifo8;                /**< <tt>\b 0x40:</tt> USBHS FIFO8 Register */
    __IO uint32_t fifo9;                /**< <tt>\b 0x44:</tt> USBHS FIFO9 Register */
    __IO uint32_t fifo10;               /**< <tt>\b 0x48:</tt> USBHS FIFO10 Register */
    __IO uint32_t fifo11;               /**< <tt>\b 0x4c:</tt> USBHS FIFO11 Register */
    __IO uint32_t fifo12;               /**< <tt>\b 0x50:</tt> USBHS FIFO12 Register */
    __IO uint32_t fifo13;               /**< <tt>\b 0x54:</tt> USBHS FIFO13 Register */
    __IO uint32_t fifo14;               /**< <tt>\b 0x58:</tt> USBHS FIFO14 Register */
    __IO uint32_t fifo15;               /**< <tt>\b 0x5c:</tt> USBHS FIFO15 Register */
    __R  uint32_t rsv_0x60_0x6b[3];
    __IO uint16_t hwvers;               /**< <tt>\b 0x6c:</tt> USBHS HWVERS Register */
    __R  uint16_t rsv_0x6e_0x77[5];
    __IO uint8_t  epinfo;               /**< <tt>\b 0x78:</tt> USBHS EPINFO Register */
    __IO uint8_t  raminfo;              /**< <tt>\b 0x79:</tt> USBHS RAMINFO Register */
    __IO uint8_t  softreset;            /**< <tt>\b 0x7A:</tt> USBHS SOFTRESET Register */
    __R  uint8_t  rsv_0x7b_0x7f[5];
    __IO uint16_t ctuch;                /**< <tt>\b 0x80:</tt> USBHS CTUCH Register */
    __IO uint16_t cthsrtn;              /**< <tt>\b 0x82:</tt> USBHS CTHSRTN Register */
    __R  uint32_t rsv_0x84_0x3ff[223];
    __IO uint32_t mxm_usb_reg_00;       /**< <tt>\b 0x400:</tt> USBHS MXM_USB_REG_00 Register */
    __IO uint32_t m31_phy_utmi_reset;   /**< <tt>\b 0x404:</tt> USBHS M31_PHY_UTMI_RESET Register */
    __IO uint32_t m31_phy_utmi_vcontrol; /**< <tt>\b 0x408:</tt> USBHS M31_PHY_UTMI_VCONTROL Register */
    __IO uint32_t m31_phy_clk_en;       /**< <tt>\b 0x40C:</tt> USBHS M31_PHY_CLK_EN Register */
    __IO uint32_t m31_phy_ponrst;       /**< <tt>\b 0x410:</tt> USBHS M31_PHY_PONRST Register */
    __IO uint32_t m31_phy_noncry_rstb;  /**< <tt>\b 0x414:</tt> USBHS M31_PHY_NONCRY_RSTB Register */
    __IO uint32_t m31_phy_noncry_en;    /**< <tt>\b 0x418:</tt> USBHS M31_PHY_NONCRY_EN Register */
    __R  uint32_t rsv_0x41c;
    __IO uint32_t m31_phy_u2_compliance_en; /**< <tt>\b 0x420:</tt> USBHS M31_PHY_U2_COMPLIANCE_EN Register */
    __IO uint32_t m31_phy_u2_compliance_dac_adj; /**< <tt>\b 0x424:</tt> USBHS M31_PHY_U2_COMPLIANCE_DAC_ADJ Register */
    __IO uint32_t m31_phy_u2_compliance_dac_adj_en; /**< <tt>\b 0x428:</tt> USBHS M31_PHY_U2_COMPLIANCE_DAC_ADJ_EN Register */
    __IO uint32_t m31_phy_clk_rdy;      /**< <tt>\b 0x42C:</tt> USBHS M31_PHY_CLK_RDY Register */
    __IO uint32_t m31_phy_pll_en;       /**< <tt>\b 0x430:</tt> USBHS M31_PHY_PLL_EN Register */
    __IO uint32_t m31_phy_bist_ok;      /**< <tt>\b 0x434:</tt> USBHS M31_PHY_BIST_OK Register */
    __IO uint32_t m31_phy_data_oe;      /**< <tt>\b 0x438:</tt> USBHS M31_PHY_DATA_OE Register */
    __IO uint32_t m31_phy_oscouten;     /**< <tt>\b 0x43C:</tt> USBHS M31_PHY_OSCOUTEN Register */
    __IO uint32_t m31_phy_lpm_alive;    /**< <tt>\b 0x440:</tt> USBHS M31_PHY_LPM_ALIVE Register */
    __IO uint32_t m31_phy_hs_bist_mode; /**< <tt>\b 0x444:</tt> USBHS M31_PHY_HS_BIST_MODE Register */
    __IO uint32_t m31_phy_coreclkin;    /**< <tt>\b 0x448:</tt> USBHS M31_PHY_CORECLKIN Register */
    __IO uint32_t m31_phy_xtlsel;       /**< <tt>\b 0x44C:</tt> USBHS M31_PHY_XTLSEL Register */
    __IO uint32_t m31_phy_ls_en;        /**< <tt>\b 0x450:</tt> USBHS M31_PHY_LS_EN Register */
    __IO uint32_t m31_phy_debug_sel;    /**< <tt>\b 0x454:</tt> USBHS M31_PHY_DEBUG_SEL Register */
    __IO uint32_t m31_phy_debug_out;    /**< <tt>\b 0x458:</tt> USBHS M31_PHY_DEBUG_OUT Register */
    __IO uint32_t m31_phy_outclksel;    /**< <tt>\b 0x45C:</tt> USBHS M31_PHY_OUTCLKSEL Register */
    __IO uint32_t m31_phy_xcfgi_31_0;   /**< <tt>\b 0x460:</tt> USBHS M31_PHY_XCFGI_31_0 Register */
    __IO uint32_t m31_phy_xcfgi_63_32;  /**< <tt>\b 0x464:</tt> USBHS M31_PHY_XCFGI_63_32 Register */
    __IO uint32_t m31_phy_xcfgi_95_64;  /**< <tt>\b 0x468:</tt> USBHS M31_PHY_XCFGI_95_64 Register */
    __IO uint32_t m31_phy_xcfgi_127_96; /**< <tt>\b 0x46C:</tt> USBHS M31_PHY_XCFGI_127_96 Register */
    __IO uint32_t m31_phy_xcfgi_137_128; /**< <tt>\b 0x470:</tt> USBHS M31_PHY_XCFGI_137_128 Register */
    __IO uint32_t m31_phy_xcfg_hs_coarse_tune_num; /**< <tt>\b 0x474:</tt> USBHS M31_PHY_XCFG_HS_COARSE_TUNE_NUM Register */
    __IO uint32_t m31_phy_xcfg_hs_fine_tune_num; /**< <tt>\b 0x478:</tt> USBHS M31_PHY_XCFG_HS_FINE_TUNE_NUM Register */
    __IO uint32_t m31_phy_xcfg_fs_coarse_tune_num; /**< <tt>\b 0x47C:</tt> USBHS M31_PHY_XCFG_FS_COARSE_TUNE_NUM Register */
    __IO uint32_t m31_phy_xcfg_fs_fine_tune_num; /**< <tt>\b 0x480:</tt> USBHS M31_PHY_XCFG_FS_FINE_TUNE_NUM Register */
    __IO uint32_t m31_phy_xcfg_lock_range_max; /**< <tt>\b 0x484:</tt> USBHS M31_PHY_XCFG_LOCK_RANGE_MAX Register */
    __IO uint32_t m31_phy_xcfgi_lock_range_min; /**< <tt>\b 0x488:</tt> USBHS M31_PHY_XCFGI_LOCK_RANGE_MIN Register */
    __IO uint32_t m31_phy_xcfg_ob_rsel; /**< <tt>\b 0x48C:</tt> USBHS M31_PHY_XCFG_OB_RSEL Register */
    __IO uint32_t m31_phy_xcfg_oc_rsel; /**< <tt>\b 0x490:</tt> USBHS M31_PHY_XCFG_OC_RSEL Register */
    __IO uint32_t m31_phy_xcfgo;        /**< <tt>\b 0x494:</tt> USBHS M31_PHY_XCFGO Register */
    __IO uint32_t mxm_int;              /**< <tt>\b 0x498:</tt> USBHS MXM_INT Register */
    __IO uint32_t mxm_int_en;           /**< <tt>\b 0x49C:</tt> USBHS MXM_INT_EN Register */
    __IO uint32_t mxm_suspend;          /**< <tt>\b 0x4A0:</tt> USBHS MXM_SUSPEND Register */
    __IO uint32_t mxm_reg_a4;           /**< <tt>\b 0x4A4:</tt> USBHS MXM_REG_A4 Register */
} mxc_usbhs_regs_t;

/* Register offsets for module USBHS */
/**
 * @ingroup    usbhs_registers
 * @defgroup   USBHS_Register_Offsets Register Offsets
 * @brief      USBHS Peripheral Register Offsets from the USBHS Base Peripheral Address.
 * @{
 */
#define MXC_R_USBHS_FADDR                  ((uint32_t)0x00000000UL) /**< Offset from USBHS Base Address: <tt> 0x0000</tt> */
#define MXC_R_USBHS_POWER                  ((uint32_t)0x00000001UL) /**< Offset from USBHS Base Address: <tt> 0x0001</tt> */
#define MXC_R_USBHS_INTRIN                 ((uint32_t)0x00000002UL) /**< Offset from USBHS Base Address: <tt> 0x0002</tt> */
#define MXC_R_USBHS_INTROUT                ((uint32_t)0x00000004UL) /**< Offset from USBHS Base Address: <tt> 0x0004</tt> */
#define MXC_R_USBHS_INTRINEN               ((uint32_t)0x00000006UL) /**< Offset from USBHS Base Address: <tt> 0x0006</tt> */
#define MXC_R_USBHS_INTROUTEN              ((uint32_t)0x00000008UL) /**< Offset from USBHS Base Address: <tt> 0x0008</tt> */
#define MXC_R_USBHS_INTRUSB                ((uint32_t)0x0000000AUL) /**< Offset from USBHS Base Address: <tt> 0x000A</tt> */
#define MXC_R_USBHS_INTRUSBEN              ((uint32_t)0x0000000BUL) /**< Offset from USBHS Base Address: <tt> 0x000B</tt> */
#define MXC_R_USBHS_FRAME                  ((uint32_t)0x0000000CUL) /**< Offset from USBHS Base Address: <tt> 0x000C</tt> */
#define MXC_R_USBHS_INDEX                  ((uint32_t)0x0000000EUL) /**< Offset from USBHS Base Address: <tt> 0x000E</tt> */
#define MXC_R_USBHS_TESTMODE               ((uint32_t)0x0000000FUL) /**< Offset from USBHS Base Address: <tt> 0x000F</tt> */
#define MXC_R_USBHS_INMAXP                 ((uint32_t)0x00000010UL) /**< Offset from USBHS Base Address: <tt> 0x0010</tt> */
#define MXC_R_USBHS_CSR0                   ((uint32_t)0x00000012UL) /**< Offset from USBHS Base Address: <tt> 0x0012</tt> */
#define MXC_R_USBHS_INCSRL                 ((uint32_t)0x00000012UL) /**< Offset from USBHS Base Address: <tt> 0x0012</tt> */
#define MXC_R_USBHS_INCSRU                 ((uint32_t)0x00000013UL) /**< Offset from USBHS Base Address: <tt> 0x0013</tt> */
#define MXC_R_USBHS_OUTMAXP                ((uint32_t)0x00000014UL) /**< Offset from USBHS Base Address: <tt> 0x0014</tt> */
#define MXC_R_USBHS_OUTCSRL                ((uint32_t)0x00000016UL) /**< Offset from USBHS Base Address: <tt> 0x0016</tt> */
#define MXC_R_USBHS_OUTCSRU                ((uint32_t)0x00000017UL) /**< Offset from USBHS Base Address: <tt> 0x0017</tt> */
#define MXC_R_USBHS_COUNT0                 ((uint32_t)0x00000018UL) /**< Offset from USBHS Base Address: <tt> 0x0018</tt> */
#define MXC_R_USBHS_OUTCOUNT               ((uint32_t)0x00000018UL) /**< Offset from USBHS Base Address: <tt> 0x0018</tt> */
#define MXC_R_USBHS_FIFO0                  ((uint32_t)0x00000020UL) /**< Offset from USBHS Base Address: <tt> 0x0020</tt> */
#define MXC_R_USBHS_FIFO1                  ((uint32_t)0x00000024UL) /**< Offset from USBHS Base Address: <tt> 0x0024</tt> */
#define MXC_R_USBHS_FIFO2                  ((uint32_t)0x00000028UL) /**< Offset from USBHS Base Address: <tt> 0x0028</tt> */
#define MXC_R_USBHS_FIFO3                  ((uint32_t)0x0000002CUL) /**< Offset from USBHS Base Address: <tt> 0x002C</tt> */
#define MXC_R_USBHS_FIFO4                  ((uint32_t)0x00000030UL) /**< Offset from USBHS Base Address: <tt> 0x0030</tt> */
#define MXC_R_USBHS_FIFO5                  ((uint32_t)0x00000034UL) /**< Offset from USBHS Base Address: <tt> 0x0034</tt> */
#define MXC_R_USBHS_FIFO6                  ((uint32_t)0x00000038UL) /**< Offset from USBHS Base Address: <tt> 0x0038</tt> */
#define MXC_R_USBHS_FIFO7                  ((uint32_t)0x0000003CUL) /**< Offset from USBHS Base Address: <tt> 0x003C</tt> */
#define MXC_R_USBHS_FIFO8                  ((uint32_t)0x00000040UL) /**< Offset from USBHS Base Address: <tt> 0x0040</tt> */
#define MXC_R_USBHS_FIFO9                  ((uint32_t)0x00000044UL) /**< Offset from USBHS Base Address: <tt> 0x0044</tt> */
#define MXC_R_USBHS_FIFO10                 ((uint32_t)0x00000048UL) /**< Offset from USBHS Base Address: <tt> 0x0048</tt> */
#define MXC_R_USBHS_FIFO11                 ((uint32_t)0x0000004CUL) /**< Offset from USBHS Base Address: <tt> 0x004C</tt> */
#define MXC_R_USBHS_FIFO12                 ((uint32_t)0x00000050UL) /**< Offset from USBHS Base Address: <tt> 0x0050</tt> */
#define MXC_R_USBHS_FIFO13                 ((uint32_t)0x00000054UL) /**< Offset from USBHS Base Address: <tt> 0x0054</tt> */
#define MXC_R_USBHS_FIFO14                 ((uint32_t)0x00000058UL) /**< Offset from USBHS Base Address: <tt> 0x0058</tt> */
#define MXC_R_USBHS_FIFO15                 ((uint32_t)0x0000005CUL) /**< Offset from USBHS Base Address: <tt> 0x005C</tt> */
#define MXC_R_USBHS_HWVERS                 ((uint32_t)0x0000006CUL) /**< Offset from USBHS Base Address: <tt> 0x006C</tt> */
#define MXC_R_USBHS_EPINFO                 ((uint32_t)0x00000078UL) /**< Offset from USBHS Base Address: <tt> 0x0078</tt> */
#define MXC_R_USBHS_RAMINFO                ((uint32_t)0x00000079UL) /**< Offset from USBHS Base Address: <tt> 0x0079</tt> */
#define MXC_R_USBHS_SOFTRESET              ((uint32_t)0x0000007AUL) /**< Offset from USBHS Base Address: <tt> 0x007A</tt> */
#define MXC_R_USBHS_CTUCH                  ((uint32_t)0x00000080UL) /**< Offset from USBHS Base Address: <tt> 0x0080</tt> */
#define MXC_R_USBHS_CTHSRTN                ((uint32_t)0x00000082UL) /**< Offset from USBHS Base Address: <tt> 0x0082</tt> */
#define MXC_R_USBHS_MXM_USB_REG_00         ((uint32_t)0x00000400UL) /**< Offset from USBHS Base Address: <tt> 0x0400</tt> */
#define MXC_R_USBHS_M31_PHY_UTMI_RESET     ((uint32_t)0x00000404UL) /**< Offset from USBHS Base Address: <tt> 0x0404</tt> */
#define MXC_R_USBHS_M31_PHY_UTMI_VCONTROL  ((uint32_t)0x00000408UL) /**< Offset from USBHS Base Address: <tt> 0x0408</tt> */
#define MXC_R_USBHS_M31_PHY_CLK_EN         ((uint32_t)0x0000040CUL) /**< Offset from USBHS Base Address: <tt> 0x040C</tt> */
#define MXC_R_USBHS_M31_PHY_PONRST         ((uint32_t)0x00000410UL) /**< Offset from USBHS Base Address: <tt> 0x0410</tt> */
#define MXC_R_USBHS_M31_PHY_NONCRY_RSTB    ((uint32_t)0x00000414UL) /**< Offset from USBHS Base Address: <tt> 0x0414</tt> */
#define MXC_R_USBHS_M31_PHY_NONCRY_EN      ((uint32_t)0x00000418UL) /**< Offset from USBHS Base Address: <tt> 0x0418</tt> */
#define MXC_R_USBHS_M31_PHY_U2_COMPLIANCE_EN ((uint32_t)0x00000420UL) /**< Offset from USBHS Base Address: <tt> 0x0420</tt> */
#define MXC_R_USBHS_M31_PHY_U2_COMPLIANCE_DAC_ADJ ((uint32_t)0x00000424UL) /**< Offset from USBHS Base Address: <tt> 0x0424</tt> */
#define MXC_R_USBHS_M31_PHY_U2_COMPLIANCE_DAC_ADJ_EN ((uint32_t)0x00000428UL) /**< Offset from USBHS Base Address: <tt> 0x0428</tt> */
#define MXC_R_USBHS_M31_PHY_CLK_RDY        ((uint32_t)0x0000042CUL) /**< Offset from USBHS Base Address: <tt> 0x042C</tt> */
#define MXC_R_USBHS_M31_PHY_PLL_EN         ((uint32_t)0x00000430UL) /**< Offset from USBHS Base Address: <tt> 0x0430</tt> */
#define MXC_R_USBHS_M31_PHY_BIST_OK        ((uint32_t)0x00000434UL) /**< Offset from USBHS Base Address: <tt> 0x0434</tt> */
#define MXC_R_USBHS_M31_PHY_DATA_OE        ((uint32_t)0x00000438UL) /**< Offset from USBHS Base Address: <tt> 0x0438</tt> */
#define MXC_R_USBHS_M31_PHY_OSCOUTEN       ((uint32_t)0x0000043CUL) /**< Offset from USBHS Base Address: <tt> 0x043C</tt> */
#define MXC_R_USBHS_M31_PHY_LPM_ALIVE      ((uint32_t)0x00000440UL) /**< Offset from USBHS Base Address: <tt> 0x0440</tt> */
#define MXC_R_USBHS_M31_PHY_HS_BIST_MODE   ((uint32_t)0x00000444UL) /**< Offset from USBHS Base Address: <tt> 0x0444</tt> */
#define MXC_R_USBHS_M31_PHY_CORECLKIN      ((uint32_t)0x00000448UL) /**< Offset from USBHS Base Address: <tt> 0x0448</tt> */
#define MXC_R_USBHS_M31_PHY_XTLSEL         ((uint32_t)0x0000044CUL) /**< Offset from USBHS Base Address: <tt> 0x044C</tt> */
#define MXC_R_USBHS_M31_PHY_LS_EN          ((uint32_t)0x00000450UL) /**< Offset from USBHS Base Address: <tt> 0x0450</tt> */
#define MXC_R_USBHS_M31_PHY_DEBUG_SEL      ((uint32_t)0x00000454UL) /**< Offset from USBHS Base Address: <tt> 0x0454</tt> */
#define MXC_R_USBHS_M31_PHY_DEBUG_OUT      ((uint32_t)0x00000458UL) /**< Offset from USBHS Base Address: <tt> 0x0458</tt> */
#define MXC_R_USBHS_M31_PHY_OUTCLKSEL      ((uint32_t)0x0000045CUL) /**< Offset from USBHS Base Address: <tt> 0x045C</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_31_0     ((uint32_t)0x00000460UL) /**< Offset from USBHS Base Address: <tt> 0x0460</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_63_32    ((uint32_t)0x00000464UL) /**< Offset from USBHS Base Address: <tt> 0x0464</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_95_64    ((uint32_t)0x00000468UL) /**< Offset from USBHS Base Address: <tt> 0x0468</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_127_96   ((uint32_t)0x0000046CUL) /**< Offset from USBHS Base Address: <tt> 0x046C</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_137_128  ((uint32_t)0x00000470UL) /**< Offset from USBHS Base Address: <tt> 0x0470</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_HS_COARSE_TUNE_NUM ((uint32_t)0x00000474UL) /**< Offset from USBHS Base Address: <tt> 0x0474</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_HS_FINE_TUNE_NUM ((uint32_t)0x00000478UL) /**< Offset from USBHS Base Address: <tt> 0x0478</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_FS_COARSE_TUNE_NUM ((uint32_t)0x0000047CUL) /**< Offset from USBHS Base Address: <tt> 0x047C</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_FS_FINE_TUNE_NUM ((uint32_t)0x00000480UL) /**< Offset from USBHS Base Address: <tt> 0x0480</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_LOCK_RANGE_MAX ((uint32_t)0x00000484UL) /**< Offset from USBHS Base Address: <tt> 0x0484</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGI_LOCK_RANGE_MIN ((uint32_t)0x00000488UL) /**< Offset from USBHS Base Address: <tt> 0x0488</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_OB_RSEL   ((uint32_t)0x0000048CUL) /**< Offset from USBHS Base Address: <tt> 0x048C</tt> */
#define MXC_R_USBHS_M31_PHY_XCFG_OC_RSEL   ((uint32_t)0x00000490UL) /**< Offset from USBHS Base Address: <tt> 0x0490</tt> */
#define MXC_R_USBHS_M31_PHY_XCFGO          ((uint32_t)0x00000494UL) /**< Offset from USBHS Base Address: <tt> 0x0494</tt> */
#define MXC_R_USBHS_MXM_INT                ((uint32_t)0x00000498UL) /**< Offset from USBHS Base Address: <tt> 0x0498</tt> */
#define MXC_R_USBHS_MXM_INT_EN             ((uint32_t)0x0000049CUL) /**< Offset from USBHS Base Address: <tt> 0x049C</tt> */
#define MXC_R_USBHS_MXM_SUSPEND            ((uint32_t)0x000004A0UL) /**< Offset from USBHS Base Address: <tt> 0x04A0</tt> */
#define MXC_R_USBHS_MXM_REG_A4             ((uint32_t)0x000004A4UL) /**< Offset from USBHS Base Address: <tt> 0x04A4</tt> */
/**@} end of group usbhs_registers */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FADDR USBHS_FADDR
 * @brief    Function address register.
 * @{
 */
#define MXC_F_USBHS_FADDR_ADDR_POS                     0 /**< FADDR_ADDR Position */
#define MXC_F_USBHS_FADDR_ADDR                         ((uint8_t)(0x7FUL << MXC_F_USBHS_FADDR_ADDR_POS)) /**< FADDR_ADDR Mask */

#define MXC_F_USBHS_FADDR_UPDATE_POS                   7 /**< FADDR_UPDATE Position */
#define MXC_F_USBHS_FADDR_UPDATE                       ((uint8_t)(0x1UL << MXC_F_USBHS_FADDR_UPDATE_POS)) /**< FADDR_UPDATE Mask */

/**@} end of group USBHS_FADDR_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_POWER USBHS_POWER
 * @brief    Power management register.
 * @{
 */
#define MXC_F_USBHS_POWER_EN_SUSPENDM_POS              0 /**< POWER_EN_SUSPENDM Position */
#define MXC_F_USBHS_POWER_EN_SUSPENDM                  ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_EN_SUSPENDM_POS)) /**< POWER_EN_SUSPENDM Mask */

