analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/usbhs_regs.h
#define MXC_F_USBHS_INCSRL_SENTSTALL_POS               5 /**< INCSRL_SENTSTALL Position */
#define MXC_F_USBHS_INCSRL_SENTSTALL                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_SENTSTALL_POS)) /**< INCSRL_SENTSTALL Mask */

#define MXC_F_USBHS_INCSRL_SENDSTALL_POS               4 /**< INCSRL_SENDSTALL Position */
#define MXC_F_USBHS_INCSRL_SENDSTALL                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_SENDSTALL_POS)) /**< INCSRL_SENDSTALL Mask */
#define MXC_V_USBHS_INCSRL_SENDSTALL_TERMINATE         ((uint8_t)0x0UL) /**< INCSRL_SENDSTALL_TERMINATE Value */
#define MXC_S_USBHS_INCSRL_SENDSTALL_TERMINATE         (MXC_V_USBHS_INCSRL_SENDSTALL_TERMINATE << MXC_F_USBHS_INCSRL_SENDSTALL_POS) /**< INCSRL_SENDSTALL_TERMINATE Setting */
#define MXC_V_USBHS_INCSRL_SENDSTALL_RESPOND           ((uint8_t)0x1UL) /**< INCSRL_SENDSTALL_RESPOND Value */
#define MXC_S_USBHS_INCSRL_SENDSTALL_RESPOND           (MXC_V_USBHS_INCSRL_SENDSTALL_RESPOND << MXC_F_USBHS_INCSRL_SENDSTALL_POS) /**< INCSRL_SENDSTALL_RESPOND Setting */

#define MXC_F_USBHS_INCSRL_FLUSHFIFO_POS               3 /**< INCSRL_FLUSHFIFO Position */
#define MXC_F_USBHS_INCSRL_FLUSHFIFO                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_FLUSHFIFO_POS)) /**< INCSRL_FLUSHFIFO Mask */

#define MXC_F_USBHS_INCSRL_UNDERRUN_POS                2 /**< INCSRL_UNDERRUN Position */
#define MXC_F_USBHS_INCSRL_UNDERRUN                    ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_UNDERRUN_POS)) /**< INCSRL_UNDERRUN Mask */

#define MXC_F_USBHS_INCSRL_FIFONOTEMPTY_POS            1 /**< INCSRL_FIFONOTEMPTY Position */
#define MXC_F_USBHS_INCSRL_FIFONOTEMPTY                ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_FIFONOTEMPTY_POS)) /**< INCSRL_FIFONOTEMPTY Mask */

#define MXC_F_USBHS_INCSRL_INPKTRDY_POS                0 /**< INCSRL_INPKTRDY Position */
#define MXC_F_USBHS_INCSRL_INPKTRDY                    ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_INPKTRDY_POS)) /**< INCSRL_INPKTRDY Mask */

/**@} end of group USBHS_INCSRL_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INCSRU USBHS_INCSRU
 * @brief    Control status upper register for INx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_INCSRU_AUTOSET_POS                 7 /**< INCSRU_AUTOSET Position */
#define MXC_F_USBHS_INCSRU_AUTOSET                     ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_AUTOSET_POS)) /**< INCSRU_AUTOSET Mask */
#define MXC_V_USBHS_INCSRU_AUTOSET_SET                 ((uint8_t)0x0UL) /**< INCSRU_AUTOSET_SET Value */
#define MXC_S_USBHS_INCSRU_AUTOSET_SET                 (MXC_V_USBHS_INCSRU_AUTOSET_SET << MXC_F_USBHS_INCSRU_AUTOSET_POS) /**< INCSRU_AUTOSET_SET Setting */
#define MXC_V_USBHS_INCSRU_AUTOSET_AUTO                ((uint8_t)0x1UL) /**< INCSRU_AUTOSET_AUTO Value */
#define MXC_S_USBHS_INCSRU_AUTOSET_AUTO                (MXC_V_USBHS_INCSRU_AUTOSET_AUTO << MXC_F_USBHS_INCSRU_AUTOSET_POS) /**< INCSRU_AUTOSET_AUTO Setting */

#define MXC_F_USBHS_INCSRU_ISO_POS                     6 /**< INCSRU_ISO Position */
#define MXC_F_USBHS_INCSRU_ISO                         ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_ISO_POS)) /**< INCSRU_ISO Mask */
#define MXC_V_USBHS_INCSRU_ISO_INTERRUPT               ((uint8_t)0x0UL) /**< INCSRU_ISO_INTERRUPT Value */
#define MXC_S_USBHS_INCSRU_ISO_INTERRUPT               (MXC_V_USBHS_INCSRU_ISO_INTERRUPT << MXC_F_USBHS_INCSRU_ISO_POS) /**< INCSRU_ISO_INTERRUPT Setting */
#define MXC_V_USBHS_INCSRU_ISO_ISOCHRONOUS             ((uint8_t)0x1UL) /**< INCSRU_ISO_ISOCHRONOUS Value */
#define MXC_S_USBHS_INCSRU_ISO_ISOCHRONOUS             (MXC_V_USBHS_INCSRU_ISO_ISOCHRONOUS << MXC_F_USBHS_INCSRU_ISO_POS) /**< INCSRU_ISO_ISOCHRONOUS Setting */

#define MXC_F_USBHS_INCSRU_MODE_POS                    5 /**< INCSRU_MODE Position */
#define MXC_F_USBHS_INCSRU_MODE                        ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_MODE_POS)) /**< INCSRU_MODE Mask */
#define MXC_V_USBHS_INCSRU_MODE_OUT                    ((uint8_t)0x0UL) /**< INCSRU_MODE_OUT Value */
#define MXC_S_USBHS_INCSRU_MODE_OUT                    (MXC_V_USBHS_INCSRU_MODE_OUT << MXC_F_USBHS_INCSRU_MODE_POS) /**< INCSRU_MODE_OUT Setting */
#define MXC_V_USBHS_INCSRU_MODE_IN                     ((uint8_t)0x1UL) /**< INCSRU_MODE_IN Value */
#define MXC_S_USBHS_INCSRU_MODE_IN                     (MXC_V_USBHS_INCSRU_MODE_IN << MXC_F_USBHS_INCSRU_MODE_POS) /**< INCSRU_MODE_IN Setting */

#define MXC_F_USBHS_INCSRU_FRCDATATOG_POS              3 /**< INCSRU_FRCDATATOG Position */
#define MXC_F_USBHS_INCSRU_FRCDATATOG                  ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_FRCDATATOG_POS)) /**< INCSRU_FRCDATATOG Mask */
#define MXC_V_USBHS_INCSRU_FRCDATATOG_RECEIVED         ((uint8_t)0x0UL) /**< INCSRU_FRCDATATOG_RECEIVED Value */
#define MXC_S_USBHS_INCSRU_FRCDATATOG_RECEIVED         (MXC_V_USBHS_INCSRU_FRCDATATOG_RECEIVED << MXC_F_USBHS_INCSRU_FRCDATATOG_POS) /**< INCSRU_FRCDATATOG_RECEIVED Setting */
#define MXC_V_USBHS_INCSRU_FRCDATATOG_DONTCARE         ((uint8_t)0x1UL) /**< INCSRU_FRCDATATOG_DONTCARE Value */
#define MXC_S_USBHS_INCSRU_FRCDATATOG_DONTCARE         (MXC_V_USBHS_INCSRU_FRCDATATOG_DONTCARE << MXC_F_USBHS_INCSRU_FRCDATATOG_POS) /**< INCSRU_FRCDATATOG_DONTCARE Setting */

#define MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS              1 /**< INCSRU_DPKTBUFDIS Position */
#define MXC_F_USBHS_INCSRU_DPKTBUFDIS                  ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS)) /**< INCSRU_DPKTBUFDIS Mask */
#define MXC_V_USBHS_INCSRU_DPKTBUFDIS_EN               ((uint8_t)0x0UL) /**< INCSRU_DPKTBUFDIS_EN Value */
#define MXC_S_USBHS_INCSRU_DPKTBUFDIS_EN               (MXC_V_USBHS_INCSRU_DPKTBUFDIS_EN << MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS) /**< INCSRU_DPKTBUFDIS_EN Setting */
#define MXC_V_USBHS_INCSRU_DPKTBUFDIS_DIS              ((uint8_t)0x1UL) /**< INCSRU_DPKTBUFDIS_DIS Value */
#define MXC_S_USBHS_INCSRU_DPKTBUFDIS_DIS              (MXC_V_USBHS_INCSRU_DPKTBUFDIS_DIS << MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS) /**< INCSRU_DPKTBUFDIS_DIS Setting */

/**@} end of group USBHS_INCSRU_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTMAXP USBHS_OUTMAXP
 * @brief    Maximum packet size for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1_POS          11 /**< OUTMAXP_NUMPACKMINUS1 Position */
#define MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1              ((uint16_t)(0x1FUL << MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1_POS)) /**< OUTMAXP_NUMPACKMINUS1 Mask */

#define MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE_POS          0 /**< OUTMAXP_MAXPACKETSIZE Position */
#define MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE              ((uint16_t)(0x7FFUL << MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE_POS)) /**< OUTMAXP_MAXPACKETSIZE Mask */

/**@} end of group USBHS_OUTMAXP_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCSRL USBHS_OUTCSRL
 * @brief    Control status lower register for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCSRL_CLRDATATOG_POS             7 /**< OUTCSRL_CLRDATATOG Position */
#define MXC_F_USBHS_OUTCSRL_CLRDATATOG                 ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_CLRDATATOG_POS)) /**< OUTCSRL_CLRDATATOG Mask */

#define MXC_F_USBHS_OUTCSRL_SENTSTALL_POS              6 /**< OUTCSRL_SENTSTALL Position */
#define MXC_F_USBHS_OUTCSRL_SENTSTALL                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_SENTSTALL_POS)) /**< OUTCSRL_SENTSTALL Mask */

