analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/usbhs_regs.h
#define MXC_F_USBHS_OUTCSRL_SENDSTALL_POS              5 /**< OUTCSRL_SENDSTALL Position */
#define MXC_F_USBHS_OUTCSRL_SENDSTALL                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_SENDSTALL_POS)) /**< OUTCSRL_SENDSTALL Mask */

#define MXC_F_USBHS_OUTCSRL_FLUSHFIFO_POS              4 /**< OUTCSRL_FLUSHFIFO Position */
#define MXC_F_USBHS_OUTCSRL_FLUSHFIFO                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_FLUSHFIFO_POS)) /**< OUTCSRL_FLUSHFIFO Mask */

#define MXC_F_USBHS_OUTCSRL_DATAERROR_POS              3 /**< OUTCSRL_DATAERROR Position */
#define MXC_F_USBHS_OUTCSRL_DATAERROR                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_DATAERROR_POS)) /**< OUTCSRL_DATAERROR Mask */

#define MXC_F_USBHS_OUTCSRL_OVERRUN_POS                2 /**< OUTCSRL_OVERRUN Position */
#define MXC_F_USBHS_OUTCSRL_OVERRUN                    ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_OVERRUN_POS)) /**< OUTCSRL_OVERRUN Mask */

#define MXC_F_USBHS_OUTCSRL_FIFOFULL_POS               1 /**< OUTCSRL_FIFOFULL Position */
#define MXC_F_USBHS_OUTCSRL_FIFOFULL                   ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_FIFOFULL_POS)) /**< OUTCSRL_FIFOFULL Mask */

#define MXC_F_USBHS_OUTCSRL_OUTPKTRDY_POS              0 /**< OUTCSRL_OUTPKTRDY Position */
#define MXC_F_USBHS_OUTCSRL_OUTPKTRDY                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_OUTPKTRDY_POS)) /**< OUTCSRL_OUTPKTRDY Mask */

/**@} end of group USBHS_OUTCSRL_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCSRU USBHS_OUTCSRU
 * @brief    Control status upper register for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCSRU_AUTOCLEAR_POS              7 /**< OUTCSRU_AUTOCLEAR Position */
#define MXC_F_USBHS_OUTCSRU_AUTOCLEAR                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_AUTOCLEAR_POS)) /**< OUTCSRU_AUTOCLEAR Mask */

#define MXC_F_USBHS_OUTCSRU_ISO_POS                    6 /**< OUTCSRU_ISO Position */
#define MXC_F_USBHS_OUTCSRU_ISO                        ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_ISO_POS)) /**< OUTCSRU_ISO Mask */

#define MXC_F_USBHS_OUTCSRU_DISNYET_POS                4 /**< OUTCSRU_DISNYET Position */
#define MXC_F_USBHS_OUTCSRU_DISNYET                    ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_DISNYET_POS)) /**< OUTCSRU_DISNYET Mask */

#define MXC_F_USBHS_OUTCSRU_DPKTBUFDIS_POS             1 /**< OUTCSRU_DPKTBUFDIS Position */
#define MXC_F_USBHS_OUTCSRU_DPKTBUFDIS                 ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_DPKTBUFDIS_POS)) /**< OUTCSRU_DPKTBUFDIS Mask */

#define MXC_F_USBHS_OUTCSRU_INCOMPRX_POS               0 /**< OUTCSRU_INCOMPRX Position */
#define MXC_F_USBHS_OUTCSRU_INCOMPRX                   ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_INCOMPRX_POS)) /**< OUTCSRU_INCOMPRX Mask */

/**@} end of group USBHS_OUTCSRU_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_COUNT0 USBHS_COUNT0
 * @brief    Number of received bytes in EP 0 FIFO (INDEX == 0).
 * @{
 */
#define MXC_F_USBHS_COUNT0_COUNT0_POS                  0 /**< COUNT0_COUNT0 Position */
#define MXC_F_USBHS_COUNT0_COUNT0                      ((uint16_t)(0x7FUL << MXC_F_USBHS_COUNT0_COUNT0_POS)) /**< COUNT0_COUNT0 Mask */

/**@} end of group USBHS_COUNT0_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCOUNT USBHS_OUTCOUNT
 * @brief    Number of received bytes in OUT EPx FIFO (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCOUNT_OUTCOUNT_POS              0 /**< OUTCOUNT_OUTCOUNT Position */
#define MXC_F_USBHS_OUTCOUNT_OUTCOUNT                  ((uint16_t)(0x1FFFUL << MXC_F_USBHS_OUTCOUNT_OUTCOUNT_POS)) /**< OUTCOUNT_OUTCOUNT Mask */

/**@} end of group USBHS_OUTCOUNT_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO0 USBHS_FIFO0
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO0_USBHS_FIFO0_POS              0 /**< FIFO0_USBHS_FIFO0 Position */
#define MXC_F_USBHS_FIFO0_USBHS_FIFO0                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO0_USBHS_FIFO0_POS)) /**< FIFO0_USBHS_FIFO0 Mask */

/**@} end of group USBHS_FIFO0_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO1 USBHS_FIFO1
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO1_USBHS_FIFO1_POS              0 /**< FIFO1_USBHS_FIFO1 Position */
#define MXC_F_USBHS_FIFO1_USBHS_FIFO1                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO1_USBHS_FIFO1_POS)) /**< FIFO1_USBHS_FIFO1 Mask */

/**@} end of group USBHS_FIFO1_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO2 USBHS_FIFO2
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO2_USBHS_FIFO2_POS              0 /**< FIFO2_USBHS_FIFO2 Position */
#define MXC_F_USBHS_FIFO2_USBHS_FIFO2                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO2_USBHS_FIFO2_POS)) /**< FIFO2_USBHS_FIFO2 Mask */

/**@} end of group USBHS_FIFO2_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO3 USBHS_FIFO3
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO3_USBHS_FIFO3_POS              0 /**< FIFO3_USBHS_FIFO3 Position */
#define MXC_F_USBHS_FIFO3_USBHS_FIFO3                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO3_USBHS_FIFO3_POS)) /**< FIFO3_USBHS_FIFO3 Mask */

/**@} end of group USBHS_FIFO3_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO4 USBHS_FIFO4
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO4_USBHS_FIFO4_POS              0 /**< FIFO4_USBHS_FIFO4 Position */
#define MXC_F_USBHS_FIFO4_USBHS_FIFO4                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO4_USBHS_FIFO4_POS)) /**< FIFO4_USBHS_FIFO4 Mask */

/**@} end of group USBHS_FIFO4_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO5 USBHS_FIFO5
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO5_USBHS_FIFO5_POS              0 /**< FIFO5_USBHS_FIFO5 Position */
#define MXC_F_USBHS_FIFO5_USBHS_FIFO5                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO5_USBHS_FIFO5_POS)) /**< FIFO5_USBHS_FIFO5 Mask */

