analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/usbhs_regs.h
/**@} end of group USBHS_FIFO5_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO6 USBHS_FIFO6
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO6_USBHS_FIFO6_POS              0 /**< FIFO6_USBHS_FIFO6 Position */
#define MXC_F_USBHS_FIFO6_USBHS_FIFO6                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO6_USBHS_FIFO6_POS)) /**< FIFO6_USBHS_FIFO6 Mask */

/**@} end of group USBHS_FIFO6_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO7 USBHS_FIFO7
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO7_USBHS_FIFO7_POS              0 /**< FIFO7_USBHS_FIFO7 Position */
#define MXC_F_USBHS_FIFO7_USBHS_FIFO7                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO7_USBHS_FIFO7_POS)) /**< FIFO7_USBHS_FIFO7 Mask */

/**@} end of group USBHS_FIFO7_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO8 USBHS_FIFO8
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO8_USBHS_FIFO8_POS              0 /**< FIFO8_USBHS_FIFO8 Position */
#define MXC_F_USBHS_FIFO8_USBHS_FIFO8                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO8_USBHS_FIFO8_POS)) /**< FIFO8_USBHS_FIFO8 Mask */

/**@} end of group USBHS_FIFO8_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO9 USBHS_FIFO9
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO9_USBHS_FIFO9_POS              0 /**< FIFO9_USBHS_FIFO9 Position */
#define MXC_F_USBHS_FIFO9_USBHS_FIFO9                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO9_USBHS_FIFO9_POS)) /**< FIFO9_USBHS_FIFO9 Mask */

/**@} end of group USBHS_FIFO9_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO10 USBHS_FIFO10
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO10_USBHS_FIFO10_POS            0 /**< FIFO10_USBHS_FIFO10 Position */
#define MXC_F_USBHS_FIFO10_USBHS_FIFO10                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO10_USBHS_FIFO10_POS)) /**< FIFO10_USBHS_FIFO10 Mask */

/**@} end of group USBHS_FIFO10_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO11 USBHS_FIFO11
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO11_USBHS_FIFO11_POS            0 /**< FIFO11_USBHS_FIFO11 Position */
#define MXC_F_USBHS_FIFO11_USBHS_FIFO11                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO11_USBHS_FIFO11_POS)) /**< FIFO11_USBHS_FIFO11 Mask */

/**@} end of group USBHS_FIFO11_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO12 USBHS_FIFO12
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO12_USBHS_FIFO12_POS            0 /**< FIFO12_USBHS_FIFO12 Position */
#define MXC_F_USBHS_FIFO12_USBHS_FIFO12                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO12_USBHS_FIFO12_POS)) /**< FIFO12_USBHS_FIFO12 Mask */

/**@} end of group USBHS_FIFO12_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO13 USBHS_FIFO13
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO13_USBHS_FIFO13_POS            0 /**< FIFO13_USBHS_FIFO13 Position */
#define MXC_F_USBHS_FIFO13_USBHS_FIFO13                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO13_USBHS_FIFO13_POS)) /**< FIFO13_USBHS_FIFO13 Mask */

/**@} end of group USBHS_FIFO13_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO14 USBHS_FIFO14
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO14_USBHS_FIFO14_POS            0 /**< FIFO14_USBHS_FIFO14 Position */
#define MXC_F_USBHS_FIFO14_USBHS_FIFO14                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO14_USBHS_FIFO14_POS)) /**< FIFO14_USBHS_FIFO14 Mask */

/**@} end of group USBHS_FIFO14_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO15 USBHS_FIFO15
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO15_USBHS_FIFO15_POS            0 /**< FIFO15_USBHS_FIFO15 Position */
#define MXC_F_USBHS_FIFO15_USBHS_FIFO15                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO15_USBHS_FIFO15_POS)) /**< FIFO15_USBHS_FIFO15 Mask */

/**@} end of group USBHS_FIFO15_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_HWVERS USBHS_HWVERS
 * @brief    HWVERS
 * @{
 */
#define MXC_F_USBHS_HWVERS_USBHS_HWVERS_POS            0 /**< HWVERS_USBHS_HWVERS Position */
#define MXC_F_USBHS_HWVERS_USBHS_HWVERS                ((uint16_t)(0xFFFFUL << MXC_F_USBHS_HWVERS_USBHS_HWVERS_POS)) /**< HWVERS_USBHS_HWVERS Mask */

/**@} end of group USBHS_HWVERS_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_EPINFO USBHS_EPINFO
 * @brief    Endpoint hardware information.
 * @{
 */
#define MXC_F_USBHS_EPINFO_OUTENDPOINTS_POS            4 /**< EPINFO_OUTENDPOINTS Position */
#define MXC_F_USBHS_EPINFO_OUTENDPOINTS                ((uint8_t)(0xFUL << MXC_F_USBHS_EPINFO_OUTENDPOINTS_POS)) /**< EPINFO_OUTENDPOINTS Mask */

#define MXC_F_USBHS_EPINFO_INTENDPOINTS_POS            0 /**< EPINFO_INTENDPOINTS Position */
#define MXC_F_USBHS_EPINFO_INTENDPOINTS                ((uint8_t)(0xFUL << MXC_F_USBHS_EPINFO_INTENDPOINTS_POS)) /**< EPINFO_INTENDPOINTS Mask */

/**@} end of group USBHS_EPINFO_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_RAMINFO USBHS_RAMINFO
 * @brief    RAM width information.
 * @{
 */
#define MXC_F_USBHS_RAMINFO_RAMBITS_POS                0 /**< RAMINFO_RAMBITS Position */
#define MXC_F_USBHS_RAMINFO_RAMBITS                    ((uint8_t)(0xFUL << MXC_F_USBHS_RAMINFO_RAMBITS_POS)) /**< RAMINFO_RAMBITS Mask */

/**@} end of group USBHS_RAMINFO_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_SOFTRESET USBHS_SOFTRESET
 * @brief    Software reset register.
 * @{
 */
#define MXC_F_USBHS_SOFTRESET_RSTXS_POS                1 /**< SOFTRESET_RSTXS Position */
#define MXC_F_USBHS_SOFTRESET_RSTXS                    ((uint8_t)(0x1UL << MXC_F_USBHS_SOFTRESET_RSTXS_POS)) /**< SOFTRESET_RSTXS Mask */

