analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/usbhs_regs.h
#define MXC_F_USBHS_SOFTRESET_RSTS_POS                 0 /**< SOFTRESET_RSTS Position */
#define MXC_F_USBHS_SOFTRESET_RSTS                     ((uint8_t)(0x1UL << MXC_F_USBHS_SOFTRESET_RSTS_POS)) /**< SOFTRESET_RSTS Mask */

/**@} end of group USBHS_SOFTRESET_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_CTUCH USBHS_CTUCH
 * @brief    Chirp timeout timer setting.
 * @{
 */
#define MXC_F_USBHS_CTUCH_C_T_UCH_POS                  0 /**< CTUCH_C_T_UCH Position */
#define MXC_F_USBHS_CTUCH_C_T_UCH                      ((uint16_t)(0xFFFFUL << MXC_F_USBHS_CTUCH_C_T_UCH_POS)) /**< CTUCH_C_T_UCH Mask */

/**@} end of group USBHS_CTUCH_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_CTHSRTN USBHS_CTHSRTN
 * @brief    Sets delay between HS resume to UTM normal operating mode.
 * @{
 */
#define MXC_F_USBHS_CTHSRTN_C_T_HSTRN_POS              0 /**< CTHSRTN_C_T_HSTRN Position */
#define MXC_F_USBHS_CTHSRTN_C_T_HSTRN                  ((uint16_t)(0xFFFFUL << MXC_F_USBHS_CTHSRTN_C_T_HSTRN_POS)) /**< CTHSRTN_C_T_HSTRN Mask */

/**@} end of group USBHS_CTHSRTN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_INT USBHS_MXM_INT
 * @brief    USB Added Maxim Interrupt Flag Register.
 * @{
 */
#define MXC_F_USBHS_MXM_INT_VBUS_POS                   0 /**< MXM_INT_VBUS Position */
#define MXC_F_USBHS_MXM_INT_VBUS                       ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_VBUS_POS)) /**< MXM_INT_VBUS Mask */

#define MXC_F_USBHS_MXM_INT_NOVBUS_POS                 1 /**< MXM_INT_NOVBUS Position */
#define MXC_F_USBHS_MXM_INT_NOVBUS                     ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_NOVBUS_POS)) /**< MXM_INT_NOVBUS Mask */

/**@} end of group USBHS_MXM_INT_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_INT_EN USBHS_MXM_INT_EN
 * @brief    USB Added Maxim Interrupt Enable Register.
 * @{
 */
#define MXC_F_USBHS_MXM_INT_EN_VBUS_POS                0 /**< MXM_INT_EN_VBUS Position */
#define MXC_F_USBHS_MXM_INT_EN_VBUS                    ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_EN_VBUS_POS)) /**< MXM_INT_EN_VBUS Mask */

#define MXC_F_USBHS_MXM_INT_EN_NOVBUS_POS              1 /**< MXM_INT_EN_NOVBUS Position */
#define MXC_F_USBHS_MXM_INT_EN_NOVBUS                  ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_EN_NOVBUS_POS)) /**< MXM_INT_EN_NOVBUS Mask */

/**@} end of group USBHS_MXM_INT_EN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_SUSPEND USBHS_MXM_SUSPEND
 * @brief    USB Added Maxim Suspend Register.
 * @{
 */
#define MXC_F_USBHS_MXM_SUSPEND_SEL_POS                0 /**< MXM_SUSPEND_SEL Position */
#define MXC_F_USBHS_MXM_SUSPEND_SEL                    ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_SUSPEND_SEL_POS)) /**< MXM_SUSPEND_SEL Mask */

/**@} end of group USBHS_MXM_SUSPEND_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_REG_A4 USBHS_MXM_REG_A4
 * @brief    USB Added Maxim Power Status Register
 * @{
 */
#define MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A_POS       0 /**< MXM_REG_A4_VRST_VDDB_N_A Position */
#define MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A           ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A_POS)) /**< MXM_REG_A4_VRST_VDDB_N_A Mask */

/**@} end of group USBHS_MXM_REG_A4_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_USBHS_REGS_H_
